{
    "author":"Garfield L'azagna",
    "title":"Wizards!",
    "date" : "2022-10-15",
    "text":"Wizards of Waverly Place is an American fantasy teen sitcom created by Todd J. Greenwald that aired on Disney Channel for four seasons between October 2007 and January 2012. The series centers on Alex Russo (Selena Gomez), a teenage wizard living on the titular street in the Greenwich Village section of New York City, who undertakes training alongside her siblings, Justin (David Henrie) and Max (Jake T. Austin), who are also equipped with magical abilities. The siblings are trained knowing that one day they will compete to win sole custody of their family's powers. Episodes focus on Alex's challenges in keeping her secret powers hidden while she deals with the social and personal issues of her youth. She frequently uses magic in her everyday life, sometimes irresponsibly, and develops her supernatural abilities over the course of the series. The main themes depicted include family, friendship and adolescence; the series also contains fantasy elements.\n\nThe Walt Disney Company developed the series to follow on from its successful line of comedy series in the 2000s, including Lizzie McGuire, The Suite Life of Zack & Cody and Hannah Montana. It's a Laugh Productions produced the program and it premiered on Disney Channel on October 12, 2007. A made-for-television film adaptation, Wizards of Waverly Place: The Movie aired on the network in 2009 and was awarded a Primetime Emmy Award for Outstanding Children's Program in 2010. The series ended on January 6, 2012 to allow Gomez to take on more mature roles. After its conclusion, the cast returned for a stand-alone television special, The Wizards Return: Alex vs. Alex, in 2013. Every season has been distributed through digital download and on the Disney+ streaming service.\n\nWizards of Waverly Place enjoyed consistently high viewership in the United States on broadcast television and tie-ins included merchandise, a soundtrack album and video game adaptations. Television critics praised the show for its humor and cast; Gomez's affiliation with the network led to a prominent musical career apart from the program. Wizards of Waverly Place won two additional Emmys for Outstanding Children's Program in 2009 and 2012, as well as two Artios Awards from the Casting Society of America for Outstanding Achievement in Casting – Children's Series Programming – between 2009 and 2012. Its series finale was the most-watched final episode of any Disney Channel show.\n"
}
