{
    "author":"Finneas Goth",
    "title":"Shoegaze",
    "date" : "2022-10-14",
    "text":"The Battle of Punta Quemada, fought sometime in January 1525, was a brief encounter between a band of Spanish conquistadors and the \"warlike natives\" of Colombia, thought to be a northern tributary tribe to the Andean Kingdom of Quito, subordinate to and as well northern capital of the Inca Empire. Though it marked the end of Francisco Pizarro's first tentative expedition along the Pacific coast, the battle also represented a crucial step to Spain's discovery and conquest of the Peru.\n\nFor weeks before their landfall at Punta Quemada, Pizarro and his company had, both on sea and on land, steadily crawled southward along the coast of Colombia, enduring both the inhospitality of the terrain and the dangers of tropical tempests. Famine and fatigue alike had ravaged the group, leaving several dead and many on the brink of incapacitation, and only Pizarro's personal charisma and the iron constitution of the Castilians had kept the crew from collapsing into mutiny and despair.[1]: 96–97 \n\nUpon reaching Punta Quemada, Pizarro, leading his men inland along unusually agreeable terrain, had discovered and occupied a large native village, the residents of which, to all appearances, had fled in terror at the sight of the Europeans. Delighted at the luck of having established quarters in such a defensible position, and mindful that his battered vessel out on the shore would not carry him much farther, Pizarro elected to send a contingent of men under Lieutenant Montenegro back to Panama for repairs and supplies while his own troops manned the village ramparts and awaited the arrival of Diego de Almagro, whose own expeditionary force, following the path of Pizarro's, was bound to arrive shortly.[1]: 100 \n\nBut the Quitians were warriors and, contrary to Spanish assessment, had abandoned their settlement only to see their women and children to safety. Armed with bows, slings, and spears, they had closely monitored the invaders and gathered unseen in the jungle in preparation for an attack.[1]: 100–101 \n\nMontenegro's column, the more vulnerable of the two Castilian parties, fell into a Quitian ambush just as it emerged from the heavy jungle foliage onto Andean foothills where arrows and other projectiles could fly unobstructed. A volley of arrows and stones struck the Spaniards. The Castilians began to fall back in panic and disarray as the natives bore down upon them.[1]: 100 \n\nMontenegro, rallying his men, ordered a return volley at the onrushing Quitians. The Spaniards shredded the native charge with a flurry of crossbow bolts, then countercharged, driving the unarmoured Quitians back. The Quitians orchestrated a similar assault on Pizarro's camp and stormed the village, unleashing a shower of missiles at the defenders. Prescott recounts that Pizarro, too bold and fiery of temper to be held inside a set of walls by enemy fire, sallied out to meet the threat, rousing his men into a charge that drove the natives back. However, the natives counterattacked, and the Spanish troops faltered.[1]: 100–101 \n\nMontenegro, fearing for his leader, had ordered an immediate march back to camp. He now appeared at the edge of the ridge and drove into the rear of the Quitian formations, shattering their resolve. Unable to resist this new threat, the natives fled into the jungle, leaving Pizarro wounded in no less than seven places.[1]: 101 \n\nThe conquistadors realized that the village was far less defensible than they had previously assumed, and fearing subsequent hostile encounters and unable to continue south by sea, Pizarro chose to end his expedition at Punta Quemada.[1]: 101 \n\nAlmagro, following in Pizarro's footsteps, later attacked and burned the village, losing an eye in the process.\n"
}
