{
    "author":"Galileo Deez",
    "title":"The *hip*tanese school of being the coolest dude",
    "date" : "2022-10-14",
    "text":"The Heptanese School of painting (Greek: Επτανησιακή Σχολή, lit. 'The School of the Seven Islands', also known as the Ionian Islands School) succeeded the Cretan School as the leading school of Greek post-Byzantine painting after Crete fell to the Ottomans in 1669. Like the Cretan school, it combined Byzantine traditions with an increasing Western European artistic influence and also saw the first significant depiction of secular subjects. The school was based in the Ionian Islands, which were not part of Ottoman Greece, from the middle of the 17th century until the middle of the 19th century. The center of Greek art migrated urgently to the Ionian islands but countless Greek artists were influenced by the school including the ones living throughout the Greek communities in the Ottoman Empire and elsewhere in the world.\n\nThe early Heptanese school was influenced by Flemish, French, Italian and German engravings. Artists representative of that era were Theodore Poulakis, Elias Moskos and Emmanuel Tzanes. Notable works include The Fall of Man and Jacob’s Ladder and Noah's Ark. The early 1700s were influenced by Greek painters Nikolaos Kallergis and Panagiotis Doxaras. Greek art was no longer limited to the traditional maniera greca dominant in the Cretan School but the style evolved into the Stile di pittura Ionico or stile Ionico in English Ionian style. The movement featured a mixture of brilliant artists. They took risks in creating art that escaped tradition. Some examples of paintings include: Virgin Glykofilousa The Deposition from the Cross and Assumption of Mary. In the 1800s the Heptanese school featured prominent portrait painters Nikolaos Kantounis, Nikolaos Koutouzis and Gerasimos Pitsamanos. Other artists of the school included Spyridon Ventouras, Efstathios Karousos, Stephanos Tzangarolas and Spyridon Sperantzas.[1][2][3]\n    "
}
