{
    "author":"Bob Barker",
    "title":"Raymond Smullyan, title",
    "date" : "2022-10-11",
    "text":"Raymond Merrill Smullyan (/ˈsmʌliən/; May 25, 1919 – February 6, 2017)[1][2][3] was an American mathematician, magician, concert pianist, logician, Taoist, and philosopher.    Born in Far Rockaway, New York, his first career was stage magic. He earned a BSc from the University of Chicago in 1955 and his PhD from Princeton University in 1959. He is one of many logicians to have studied with Alonzo Church.[1]    He was born on May 25, 1919, in Far Rockaway, Queens, New York, to an Ashkenazi Jewish family. His father was Isidore Smullyan, who was born in Russia but who emigrated to Belgium when young, and whose native language was French. His father was a businessman who graduated from the University of Antwerp. His mother was Rosina Smullyan (née Freeman), who was born and raised in London. She was a painter, who was also an actress.[4] Both parents were musical, his father playing the violin and his mother playing the piano.[5] He was the youngest of three children. His eldest brother, Emile Benoit Smullyan, later became an economist under the name of Emile Benoit. His sister was Gladys Smullyan, later Gladys Gwynn.[6] His cousin was the philosopher Arthur Francis Smullyan (1912-1998).[7] In Far Rockaway he was a grade school classmate of Richard Feynman.[5]    Smullyan showed musical talent from a young age, playing both violin and piano. He studied with pianist Grace Hofheimer in New York.[8] He had perfect pitch.[5] He started his interest in logic at the age of 5.[9] In 1931 he won a gold medal in the piano competition of the New York Music Week Association when he was aged 12 (the previous year he had won the silver medal).[5] After graduating from grade school, the Depression forced his family moved to Manhattan, and he attended Theodore Roosevelt High School in The Bronx. He played violin in the school orchestra but devoted more time to playing the piano. At high school he fell in love with mathematics when he took a class in geometry. Apart from his classes in geometry, physics, and chemistry, however, he was dissatisfied with his high school, and dropped out. He studied mathematics on his own, including analytic geometry, calculus, and modern higher algebra - particularly group theory and Galois theory. He sat in on a course taught by Ernest Nagel at Columbia University that was being taken by his cousin, Arthur Smullyan, and independently discovered Boolean rings. He also spent a year at the Cambridge Rindge and Latin School.[5] He did not graduate with a high school diploma, but he took the college board exams to get into college.[5] He studied mathematics and music at Pacific University in Oregon for one semester, and at Reed College for less than a semester, before following the pianist Berhard Abramowitsch to San Francisco.[5] He audited classes at the University of California, Berkeley, before returning to New York, where he continued his independent study of modern abstract algebra. At this time he composed a number of chess problems which were published many years later; he also learned magic. At the age of 24, he enrolled at the University of Wisconsin-Madison for three semesters, because he wanted to study modern algebra with a professor whose book he had read.[10] He later transferred to the University of Chicago and majored in mathematics. After a break in which he worked as a magician in New York and met his first wife, he returned to the University of Chicago, where he also worked as a magician at night and taught piano on the faculty at Roosevelt University. While at Chicago he took three courses with the philosopher Rudolf Carnap, for which he wrote three term papers. Carnap recommended that he send the first term paper to Willard Van Orman Quine, which he did. Quine replied that he should tinker with his idea about what makes quantification theory tick. Of the other two term papers, one, entitled 'Languages in which Self-Reference is Possible' (which Carnap showed to Kurt Gödel), was later published in 1957. The other was later published in his 1961 book Theory of Formal Systems. While still a student at the University of Chicago, on the basis of a recommendation from Carnap, he was hired by John G. Kemeny, the chair of the mathematics department at Dartmouth College. He taught at Dartmouth for two years. During that time he separated from his first wife, from whom he later divorced. He also used to visit his friends Gloria and Marvin Minsky (Gloria Minsky was his cousin) in Cambridge, Massachusetts.[5] The University of Chicago, after a battle between the faculty and administration, agreed to award Smullyan a bachelor of science degree in mathematics in 1955 based partly on courses he had taught at Dartmouth (although he had not taken them at Chicago). Both Carnap and Kemeny helped him to get accepted to the graduate program in mathematics at Princeton University.[11] He received a PhD in mathematics from Princeton University in 1959. He completed his doctoral dissertation, titled 'Theory of formal systems', under the supervision of Alonzo Church, which was published in 1961.[12] While a graduate student at Princeton he met his second wife, Blanche, a pianist and teacher, born in Belgium, to whom he was married for 48 years until she died in 2005.    While a PhD student, his term paper for Carnap, 'Languages in which Self-Reference is Possible', was published in 1957 in the Journal of Symbolic Logic,[13] showing that Gödelian incompleteness held for formal systems considerably more elementary than that of Kurt Gödel's 1931 landmark paper. The contemporary understanding of Gödel's theorem dates from this paper. Smullyan later made a compelling case that much of the fascination with Gödel's theorem should be directed at Tarski's theorem, which is much easier to prove and equally disturbing philosophically.[14]    After getting his PhD from Princeton, he taught at Princeton for two years. He subsequently taught at New York University, at the State University of New York at New Paltz, at Smith College, and at the Belfer Graduate School of Science at Yeshiva University, before becoming professor of mathematics and computer science at Lehman College in the Bronx, where he taught undergraduate students from 1968 to 1984.[15] He was also a professor of philosophy at the CUNY Graduate Center from 1976 to 1984, where he taught graduate students.[16] He was subsequently a professor of philosophy at Indiana University, where he taught both undergraduate and graduate students. He was also an amateur astronomer, using a six-inch reflecting telescope for which he ground the mirror.[1] Fellow mathematician Martin Gardner was a close friend.        Smullyan wrote many books about recreational mathematics and recreational logic. Most notably, one is titled What Is the Name of This Book? ISBN 0139550623. His A Beginner's Further Guide to Mathematical Logic ISBN 978-981-4730-99-0, published in 2017, was his final book."
}
