{
    "author":"Bob Barker",
    "date" : "2022-10-12",
    "text":"Dennis MacAlistair Ritchie (September 9, 1941 – c. October 12, 2011) was an American computer scientist.[1] He is most well-known for creating the C programming language and, with long-time colleague Ken Thompson, the Unix operating system and B programming language.[1] Ritchie and Thompson were awarded the Turing Award from the ACM in 1983, the Hamming Medal from the IEEE in 1990 and the National Medal of Technology from President Bill Clinton in 1999. Ritchie was the head of Lucent Technologies System Software Research Department when he retired in 2007. He was the 'R' in K&R C, and commonly known by his username dmr.Contents1Personal life and career2C and Unix3Awards4Death5Legacy6Gallery7Notable works8Publications and academic papers9See also10References11External linksPersonal life and careerDennis Ritchie was born in Bronxville, New York. His father was Alistair E. Ritchie, a longtime Bell Labs scientist and co-author of The Design of Switching Circuits[7] on switching circuit theory.[8] As a child, Dennis moved with his family to Summit, New Jersey, where he graduated from Summit High School.[9] He graduated from Harvard University with degrees in physics and applied mathematics.[8]Ken Thompson (left) and Dennis Ritchie (right)Version 7 Unix for the PDP-11, including Dennis Ritchie's home directory: /usr/dmrIn 1967, Ritchie began working at the Bell Labs Computing Sciences Research Center, and in 1968, he defended his PhD thesis on 'Computational Complexity and Program Structure' at Harvard under the supervision of Patrick C. Fischer. However, Ritchie never officially received his PhD degree as he did not submit a bound copy of his dissertation to the Harvard library, a requirement for the degree.[10][11] In 2020, the Computer History Museum worked with Ritchie's family and Fischer's family and found a copy of the lost dissertation.[11]During the 1960s, Ritchie and Ken Thompson worked on the Multics operating system at Bell Labs. Thompson then found an old PDP-7 machine and developed his own application programs and operating system from scratch, aided by Ritchie and others. In 1970, Brian Kernighan suggested the name 'Unix', a pun on the name 'Multics'.[12] To supplement assembly language with a system-level programming language, Thompson created B. Later, B was replaced by C, created by Ritchie, who continued to contribute to the development of Unix and C for many years.[13]During the 1970s, Ritchie collaborated with James Reeds and Robert Morris on a ciphertext-only attack on the M-209 US cipher machine that could solve messages of at least 2000–2500 letters.[14] Ritchie relates that, after discussions with the National Security Agency, the authors decided not to publish it, as they were told that the principle was applicable to machines still in use by foreign governments.[14]Ritchie was also involved with the development of the Plan 9 and Inferno operating systems, and the programming language Limbo.As part of an AT&T restructuring in the mid-1990s, Ritchie was transferred to Lucent Technologies, where he retired in 2007 as head of System Software Research Department.[15]"
}
